import string
import keyword
name = input('Введіть, будь ласка, назву змінної: ')
if not name: #перевірка порожньої строки
    print(False, 'Назва змінної не може бути порожнею строкою. Введить коректне ім"я, будь ласка.')
if name[0].isdigit(): #перевірка чи починається ім'я зі цифри
    print(False, 'Назва змінної не може починатися з цифри. Введить коректне ім"я, будь ласка.')
elif any(ch.isupper() for ch in name): #перевірка на наявність великих літер
    print(False, 'Назва змінної не може містити великі літери. Введить коректне ім"я, будь ласка.')
elif any(ch in string.punctuation.replace('_', '') for ch in name) or any(ch.isspace() for ch in name): #перевірка на наявність недопустимих симоволів
    print(False, 'Назва змінної не може містити знаки пунктуації або пробіли. Введить коректне ім"я, будь ласка.')
elif name in keyword.kwlist: #перевірка на наявність зарезервованих слів
    print(False, 'Назва змінної не може містити зарезервовані слова. Введить коректне ім"я, будь ласка.')
elif name.count('_') > 1: # перевірка чи містить назва змінної більше одного "_"
    print(False, 'Назва змінної не може містити більше одного "_". Введить коректне ім"я, будь ласка.')
else:
    print(True, 'Назва змінної коректна.')
